Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: འགྲོ་བ་ཀུན་གྱི་ཆོས་ཀྱི་དོན་རྣམས་ནི། །འཐུན་པར་གྱུར་ཅིང་རེ་བའང་གྲུབ་པར་ཤོག །
en: May all beings be successful in their Dharma goals, And may their wishes be fulfilled.

source: བྱང་ཆུབ་སྤྱོད་པ་དག་ནི་བདག་སྤྱོད་ཅིང་། །འགྲོ་བ་ཀུན་ཏུ་སྐྱེ་བ་དྲན་པར་གྱུར། །
en: {15} May I practice the conduct of enlightenment And remember my lives in all existences.

source: ཚེ་རབས་ཀུན་ཏུ་འཆི་འཕོ་སྐྱེ་བ་ན། །རྟག་ཏུ་བདག་ནི་རབ་ཏུ་འབྱུང་བར་ཤོག །
en: May I always practice mendicancy In all my lifetimes of deaths and rebirths.

source: རྒྱལ་བ་ཀུན་གྱི་རྗེས་སུ་སློབ་གྱུར་ཏེ། །བཟང་པོ་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་བྱེད་ཅིང་། །ཚུལ་ཁྲིམས་སྤྱོད་པ་དྲི་མེད་ཡོངས་དག་པར། །རྟག་ཏུ་མ་ཉམས་སྐྱོན་མེད་སྤྱོད་པར་ཤོག །
en: {16} Following the teaching of all the jinas And perfecting my good conduct, May I always practice stainless, pure, Correct conduct that is flawless and unblemished.

source: ལྷ་ཡི་སྐད་དང་ཀླུ་དང་གནོད་སྦྱིན་སྐད། །གྲུལ་བུམ་དག་དང་མི་ཡི་སྐད་རྣམས་དང་། །འགྲོ་བ་ཀུན་གྱི་སྒྲ་རྣམས་ཇི་ཙམ་པར། །ཐམས་ཅད་སྐད་དུ་བདག་གིས་ཆོས་བསྟན་ཏོ། །
en: {17} May I teach the Dharma in all languages, Whatever the languages of beings: Through the languages of devas, the languages of nāgas, The languages of yakṣas, kumbhāṇḍas, and humans.

source: ངེས་ཤིང་ཕ་རོལ་ཕྱིན་ལ་རབ་བརྩོན་ཏེ། །བྱང་ཆུབ་སེམས་ནི་ནམ་ཡང་བརྗེད་མ་གྱུར། །
en: {18} May one who is gentle and dedicated to the perfections Never forget the aspiration to enlightenment.

source: སྡིག་པ་གང་རྣམས་སྒྲིབ་པར་འགྱུར་བ་དག །དེ་དག་མ་ལུས་ཡོངས་སུ་བྱང་བར་ཤོག །
en: May the obscurations of bad karma Be purified without any remainder.

source: ལས་དང་ཉོན་མོངས་བདུད་ཀྱི་ལས་རྣམས་ལས། །གྲོལ་ཞིང་འཇིག་རྟེན་འགྲོ་བ་རྣམས་སུ་ཡང་། ཇི་ལྟར་པད་མོ་ཆུས་མི་ཆགས་པ་བཞིན། །ཉི་ཟླ་ནམ་མཁར་ཐོགས་པ་མེད་ལྟར་སྤྱད། །ཞིང་གི་ཁྱོན་དང་ཕྱོགས་རྣམས་ཇི་ཙམ་པར། །
en: {19} May my conduct, even in the worldly existences, Be free of karma, kleśas, and the actions of Māra, Just as the lotus is unstained by water And the sun and moon are unobstructed in the sky.

source: ངན་སོང་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱེད། །བདེ་བ་དག་ལ་འགྲོ་བ་ཀུན་འགོད་ཅིང་། །འགྲོ་བ་ཐམས་ཅད་ལ་ནི་ཕན་པར་སྤྱད། །
en: {20} May I end all the sufferings of lower existences And establish all beings in happiness, Practicing a conduct that brings benefit to all beings Throughout the directions and the extent of realms.

source: བྱང་ཆུབ་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་བྱེད་ཅིང་། །སེམས་ཅན་དག་གི་སྤྱོད་དང་མཐུན་པར་འཇུག །བཟང་པོ་སྤྱོད་པ་དག་ནི་རབ་སྟོན་ཅིང་། །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་སྤྱོད་པར་འགྱུར། །
en: {21} May I practice this conduct in all future kalpas, Conforming with the conduct of beings, Perfecting the conduct of enlightenment, And teaching good conduct.

source: བདག་གི་སྤྱོད་དང་མཚུངས་པར་གང་སྤྱོད་པ། །དེ་དག་དང་ནི་རྟག་ཏུ་འགྲོགས་པར་ཤོག །
en: {22} May I always be in the company of those Whose conduct is in harmony with my conduct.

source: ལུས་དང་ངག་རྣམས་དང་ནི་སེམས་ཀྱིས་ཀྱང་། །སྤྱོད་པ་དག་དང་སྨོན་ལམ་གཅིག་ཏུ་སྤྱད། །
en: May my body, my speech, and also my mind Practice the same conduct and have the same prayer.

source: བདག་ལ་ཕན་པར་འདོད་པའི་གྲོགས་པོ་དག །བཟང་པོ་སྤྱོད་པ་རབ་ཏུ་སྟོན་པ་རྣམས། །དེ་དག་དང་ཡང་རྟག་ཏུ་ཕྲད་པར་ཤོག །དེ་དག་བདག་གིས་ནམ་ཡང་ཡིད་མི་དབྱུང་། །
en: {23} May I always associate With friends who wish to benefit me And teach me the correct conduct, And may I never displease them.

source: སངས་རྒྱས་སྲས་ཀྱིས་བསྐོར་བའི་མགོན་པོ་རྣམས། །མངོན་སུམ་རྟག་ཏུ་བདག་གིས་རྒྱལ་བ་ལྟ། །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་མི་སྐྱོ་བར། །དེ་དག་ལ་ཡང་མཆོད་པ་རྒྱ་ཆེར་བགྱི། །
en: {24} May I always see before me the jinas, The lords who are encircled by bodhisattvas, And may I make vast offerings to them, Without wearying, throughout all future kalpas.

source: རྒྱལ་བ་རྣམས་ཀྱི་དམ་པའི་ཆོས་འཛིན་ཅིང་། །བྱང་ཆུབ་སྤྱོད་པ་ཀུན་ཏུ་སྣང་བར་བྱེད། །བཟང་པོ་སྤྱོད་པ་རྣམ་པར་སྦྱངས་པ་ཡང་། །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་སྤྱད་པར་བགྱི། །
en: {28} Keeping the good Dharma of the jinas, Expounding the conduct of enlightenment, And purifying the good conduct, May I practice that conduct in all future kalpas.

source: སྲིད་པ་ཐམས་ཅད་དུ་ཡང་འཁོར་བ་ན། །བསོད་ནམས་ཡེ་ཤེས་དག་ནི་མི་ཟད་རྙེད། །
en: {26} While circling through all existences, May I obtain inexhaustible merit and knowledge.

source: ཐབས་དང་ཤེས་རབ་ཏིང་འཛིན་རྣམ་ཐར་དང་། །ཡོན་ཏན་ཀུན་གྱི་མི་ཟད་མཛོད་དུ་གྱུར། །
en: May I be an inexhaustible treasure of wisdom, Methods, samādhis, liberations, and all good qualities.

source: རྡུལ་གཅིག་སྟེང་ན་རྡུལ་སྙེད་ཞིང་རྣམས་ཏེ། །ཞིང་དེར་བསམ་གྱིས་མི་ཁྱབ་སངས་རྒྱས་རྣམས། །སངས་རྒྱས་སྲས་ཀྱི་དབུས་ན་བཞུགས་པ་ལ། །བྱང་ཆུབ་སྤྱོད་པ་སྤྱོད་ཅིང་བལྟ་བར་བགྱི། །
en: {27} There are realms as numerous as atoms in each atom, And while practicing the conduct of enlightenment, May I see in those realms countless buddhas Who are seated in the midst of bodhisattvas.

source: དེ་དག་མ་ལུས་ཐམས་ཅད་ཕྱོགས་སུ་ཡང་། །སྐྲ་ཙམ་ཁྱོན་ལ་དུས་གསུམ་ཚད་སྙེད་ཀྱི། །སངས་རྒྱས་རྒྱ་མཚོ་ཞིང་རྣམས་རྒྱ་མཚོ་དང་། །བསྐལ་པ་རྒྱ་མཚོར་སྤྱོད་ཅིང་རབ་ཏུ་འཇུག །
en: {28} May I engage in practicing conduct for an ocean of kalpas Within every hair’s breadth in every direction, Without exception, in which there are an ocean Of buddhas of the three times, and an ocean of realms.

source: གསུང་གཅིག་ཡན་ལག་རྒྱ་མཚོའི་སྒྲ་སྐད་ཀྱིས། །རྒྱལ་བ་ཀུན་དབྱངས་ཡན་ལག་རྣམ་དག་པ། །འགྲོ་བ་ཀུན་གྱི་བསམ་པ་ཇི་བཞིན་དབྱངས། །སངས་རྒྱས་གསུང་ལ་རྟག་ཏུ་འཇུག་པར་བགྱི། །
en: {29} May I always comprehend the speech of the buddhas, Which, through having an ocean of languages in a single syllable, Has the purity of the aspects of the speech of all the jinas And words that accord with the aspirations of all beings.

source: དུས་གསུམ་གཤེགས་པ་རྒྱས་བ་ཐམས་ཅད་དག །འཁོར་ལོའི་ཚུལ་རྣམས་རབ་ཏུ་བསྐོར་བ་ཡིས། །དེ་དག་གི་ཡང་གསུང་དབྱངས་མྱི་ཟད་ལ། །བློ་ཡི་སྟོབས་ཀྱིས་བདག་ཀྱང་རབ་ཏུ་འཇུག །
en: {30} May I comprehend, through the power of the mind, The unceasing sounds of the voices Of the jinas in the three times, Who are turning the wheel in various ways.

source: མ་འོངས་བསྐལ་བ་ཐམས་ཅད་འཇུག་པར་ཡང་། །སྐད་ཅིག་གཅིག་གིས་བདག་ཀྱང་འཇུག་པར་བགྱི། །གང་ཡང་བསྐལ་པ་དུས་གསུམ་ཚད་དེ་དག །སྐད་ཅིག་ཆ་ཤས་ཀྱིས་ནི་ཞུགས་པར་སྤྱད། །
en: {31} May I enter all the future kalpas, Entering them in a single instant, And in a fraction of an instant practice The conduct throughout the kalpas of the three times.

source: དུས་གསུམ་གཤེགས་པ་མི་ཡི་སེང་གེ་དག །དེ་དག་སྐད་ཅིག་གཅིག་ལ་བདག་གིས་བལྟ། །
en: {32} May I in a single instant see The lions among humans in the three times.

source: རྟག་ཏུ་དེ་དག་གི་ནི་སྤྱོད་ཡུལ་ལ། །སྒྱུ་མར་གྱུར་པའི་རྣམ་ཐར་སྟོབས་ཀྱིས་འཇུག །
en: Through the power of the liberation of being an illusion, May I always enter into their conduct.

source: གང་ཡང་དུས་གསུམ་དག་གི་ཞིང་བཀོད་པ། །དེ་དག་རྡུལ་གཅིག་སྟེང་དུ་མངོན་པར་བསྒྲུབ། །
en: {33} May the displays of realms in the three times Be accomplished within a single atom.

source: དེ་ལྟར་མ་ལུས་ཕྱོགས་རྣམས་ཐམས་ཅད་དུ། །རྒྱལ་བ་རྣམས་ཀྱི་ཞིང་གི་རྒྱན་ལ་འཇུག །
en: May I perceive such displays of the realms of the jinas That are in every direction without exception.

source: གང་ཡང་མ་བྱོན་འཇིག་རྟེན་སྒྲོན་མ་རྣམས། །དེ་དག་རིམ་པར་འཚང་རྒྱ་འཁོར་ལོ་བསྐོར། །མྱ་ངན་འདས་པ་རབ་ཏུ་ཞི་མཐའ་སྟོན། །མགོན་པོ་ཀུན་གྱི་དྲུང་དུ་བདག་མཆིའོ། །
en: {34} May I go into the presence of all those lords, Those future lamps of the world, who will successively Attain enlightenment, turn the wheel, And demonstrate the final peace of entering nirvāṇa.

source: ཀུན་ཏུ་མྱུར་བའི་རྫུ་འཕྲུལ་སྟོབས་རྣམས་དང་། །ཀུན་ནས་སྒོ་ཡི་ཐེག་པའི་སྟོབས་དག་དང་། །ཀུན་ཏུ་ཡོན་ཏན་སྤྱོད་པའི་སྟོབས་རྣམས་དང་། །ཀུན་ཏུ་ཁྱབ་པ་བྱམས་པ་དག་གི་སྟོབས། །ཀུན་ཏུ་དགེ་བའི་བསོད་ནམས་སྟོབས་རྣམས་དང་། །ཆགས་པ་མེད་པར་གྱུར་པའི་ཡེ་ཤེས་སྟོབས། །ཤེས་རབ་ཐབས་དང་ཏིང་འཛིན་སྟོབས་དག་གིས། །
en: {35} Through the power of miracles that has complete speed, Through the power of yānas that possesses every gateway, Through the power of conduct that has the complete qualities, Through the power of love that is universal, {36} Through the power of merit that has complete goodness, Through the power of knowledge that is without impediment, Through the power of wisdom, methods, and samādhi, May I accomplish the power of enlightenment.

source: བྱང་ཆུབ་སྟོབས་རྣམས་ཡང་དག་སྒྲུབ་པར་བྱེད། །ལས་ཀྱི་སྟོབས་རྣམས་ཡོངས་སུ་དག་བྱེད་ཅིང་། །ཉོན་མོངས་སྟོབས་རྣམས་ཀུན་ཏུ་འཇོམས་པར་བྱེད། །བདུད་ཀྱི་སྟོབས་རྣམས་སྟོབས་མེད་རབ་བྱེད་ཅིང་། །བཟང་པོ་སྤྱོད་པའི་སྟོབས་ནི་རྫོགས་པར་བགྱི། །
en: {37} May I purify the power of karma, Destroy the power of the kleśas, Render powerless the power of the māras, And make complete all the powers of good conduct.

source: ཞིང་རྣམས་རྒྱ་མཚོ་རྣམ་པར་དག་བྱེད་ཅིང་། །སེམས་ཅན་རྒྱ་མཚོ་དག་ནི་རྣམ་པར་སྒྲོལ། །ཆོས་རྣམས་རྒྱ་མཚོ་རབ་ཏུ་མཐོང་བྱེད་ཅིང་། །ཡེ་ཤེས་རྒྱ་མཚོ་རབ་ཏུ་རྟོགས་པར་བྱེད། །
en: {38} May I purify an ocean of realms, Liberate an ocean of beings, See an ocean of the Dharma, And realize an ocean of knowledge.

source: སྤྱོད་པ་རྒྱ་མཚོ་རྣམ་པར་དག་བྱེད་ཅིང་། །སྨོན་ལམ་རྒྱ་མཚོ་རབ་ཏུ་རྫོགས་པར་བྱེད། །སངས་རྒྱས་རྒྱ་མཚོ་རབ་ཏུ་མཆོད་བྱེད་ཅིང་། །བསྐལ་པ་རྒྱ་མཚོར་མི་སྐྱོ་སྤྱད་པར་བགྱི། །
en: {39} May I purify an ocean of conduct, Fulfill an ocean of prayers, Make offerings to an ocean of buddhas, And have tireless conduct for an ocean of kalpas.

source: གང་ཡང་དུས་གསུམ་གཤེགས་པ་རྒྱལ་བ་ཡི། །བྱང་ཆུབ་སྤྱོད་པའི་སྨོན་ལམ་བྱེ་བྲག་རྣམས། །བཟང་པོ་སྤྱོད་པས་བྱང་ཆུབ་སངས་རྒྱས་ནས། །དེ་ཀུན་བདག་གིས་མ་ལུས་རྫོགས་པར་བགྱི། །
en: {40} May I, through good conduct, realize enlightenment And fulfill, without exception, All the specific prayers of enlightened conduct That are made by the jinas in the three times.

source: རྒྱལ་བ་ཀུན་གྱི་སྲས་ཀྱི་ཐུ་བོ་བ། །གང་གི་མིང་ནི་ཀུན་ཏུ་བཟང་ཞེས་བྱ། །མཁས་པ་དེ་དང་མཚུངས་པར་སྤྱད་པའི་ཕྱིར། །དགེ་བ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བསྔོ། །
en: {41} I dedicate all this virtue So that I may have the same conduct as that wise one, The eldest son of all the jinas, Whose name is Samanta­bhadra.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱང་རྣམ་དག་ཅིང་། །སྤྱོད་པ་རྣམ་དག་ཞིང་རྣམས་ཡོངས་དག་དང་། །བསྔོ་བ་བཟང་པོ་མཁས་པ་ཅི་འདྲ་བར། །དེ་འདྲར་བདག་ཀྱང་དེ་དང་མཚུངས་པར་ཤོག །
en: {42} Just as the good wise one made a dedication For a pure body, speech, and mind, A pure conduct, and a pure realm, May it be the same for me.

source: ཀུན་ནས་དགེ་བ་བཟང་པོ་སྤྱོད་པའི་ཕྱིར། །འཇམ་དཔལ་གྱི་ནི་སྨོན་ལམ་སྤྱད་པར་བགྱི། །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་མི་སྐྱོ་བར། །
en: {43} May I practice the conduct of Mañjuśrī’s prayer For good conduct, for complete goodness, Without weariness throughout the kalpas to come.

source: དེ་ཡི་བྱ་བ་མ་ལུས་རྫོགས་པར་བགྱི། །སྤྱོད་པ་དག་ནི་ཚད་ཡོད་མ་གྱུར་ཅིག །
en: May I complete all those activities without exception.

source: ཡོན་ཏན་རྣམས་ཀྱང་ཚད་གཟུང་མེད་པར་ཤོག །སྤྱོད་པ་ཚད་མེད་པ་ལ་གནས་ནས་ཀྱང་། །དེ་དག་འཕྲུལ་པ་ཐམས་ཅད་འཚལ་བར་བགྱི། །
en: {44} May there be no limit to that conduct; May there be no limit to those good qualities, And having maintained a conduct that has no limit, May I give rise to all those miraculous powers.

source: ནམ་མཁའི་མཐར་ཐུག་གྱུར་པ་ཇི་ཙམ་པར། །སེམས་ཅན་མ་ལུས་མཐའ་ཡང་དེ་བཞིན་ཏེ། །
en: {45} If there were an end to space, There would be an end to all beings.

source: ཅི་ཙམ་ལས་དང་ཉོན་མོངས་མཐར་གྱུར་པ། །བདག་གི་སྨོན་ལམ་མཐའ་ཡང་དེ་ཙམ་མོ། །
en: Only when their karma and kleśas end Will my prayers also come to an end.

source: གང་ཡང་ཕྱོགས་བཅུའི་ཞིང་རྣམས་མཐའ་ཡས་པ། །རིན་ཆེན་བརྒྱན་ཏེ་རྒྱལ་བ་རྣམས་ལ་ཕུལ། །ལྷ་དང་མི་ཡི་བདེ་བ་མཆོག་རྣམས་ཀྱང་། །ཞིང་གི་རྡུལ་སྙེད་བསྐལ་བར་ཕུལ་བ་བས། །གང་གིས་བསྔོ་བའི་རྒྱལ་པོ་འདི་ཐོས་ནས། །བྱང་ཆུབ་མཆོག་གི་རྗེས་སུ་རབ་མོས་ཤིང་། །ལན་ཅིག་ཙམ་ཡང་དད་པ་བསྐྱེད་པས་ནི། །
en: {46} If someone offered to the jinas the endless realms In the ten directions adorned with jewels And the most excellent pleasures of devas and humans For kalpas as numerous as the atoms in a realm, {47} Someone who has faith just once On hearing this king of dedications And aspires to attain perfect enlightenment Will have a higher, superior merit.

source: བསོད་ནམས་དམ་པའི་མཆོག་ཏུ་འདི་འགྱུར་རོ། །གང་གིས་བཟང་སྤྱོད་སྨོན་ལམ་འདི་བཏབ་པ། །དེས་ནི་ངན་སོང་ཐམས་ཅད་སྤོང་བར་འགྱུར། །དེས་ནི་གྲོགས་པོ་ངན་པ་སྤངས་པ་ཡིན། །སྣང་བ་མཐའ་ཡས་དེ་ཡང་དེས་མྱུར་མཐོང་། །
en: {48} Whoever recites this prayer for good conduct Will be free from all lower existences, Will be free from bad companions, And will quickly see Amitābha.

source: དེ་དག་རྙེད་པ་རབ་རྙེད་བདེ་བར་འཚོ། །མི་ཚེ་འདིར་ཡང་དེ་དག་ལེགས་པར་འོང་། །ཀུན་ཏུ་བཟང་པོ་དེ་ཡང་ཇི་འདྲ་བར། །དེ་དག་རིང་པོར་མི་ཐོགས་དེ་བཞིན་འགྱུར། །
en: {49} They will have in this life the good fortune Of obtaining success, a happy life, And will soon become The same as Samanta­bhadra.

source: མཚམས་མེད་ལྔ་པོ་དག་གི་སྡིག་པ་རྣམས། །གང་གི་མི་ཤེས་དབང་གིས་བྱས་པ་དག །དེ་ཡིས་བཟང་པོ་སྤྱོད་པ་འདི་བརྗོད་ན། །མྱུར་དུ་མ་ལུས་ཡོངས་སུ་བྱང་བར་འགྱུར། །
en: {50} If someone through the power of ignorance Has the bad karma of the five actions with immediate results, They will be purified of it, without any remainder Through reciting this prayer for good conduct.

source: ཡེ་ཤེས་དང་ནི་གཟུགས་དང་མཚན་རྣམས་དང་། །རིགས་དང་ཁ་དོག་རྣམས་དང་ལྡན་པར་འགྱུར། །བདུད་དང་མུ་སྟེགས་མང་པོས་དེ་མྱི་ཐུབ། །འཇིག་རྟེན་གསུམ་པོ་ཀུན་ནའང་མཆོད་པར་འགྱུར། །
en: {51} They will have the wisdom, form, Features, family, and color, Be invincible to hosts of māras and tīrthikas, And be offered to by the entire three realms.

source: བྱང་ཆུབ་ཤིང་དབང་དྲུང་དུ་དེ་མྱུར་འགྲོ། །སོང་ནས་སེམས་ཅན་ཕན་ཕྱིར་དེར་འདུག་སྟེ། །བྱང་ཆུབ་སངས་རྒྱས་འཁོར་ལོ་རབ་ཏུ་བསྐོར། །བདུད་རྣམས་སྡེ་དང་བཅས་པ་ཐམས་ཅད་བཏུལ། །
en: {52} They will soon go to the Bodhi tree, the lord of trees, And having reached there be seated for the benefit of beings, Become enlightened in buddhahood, turn the wheel of the Dharma, And overpower Māra and his entire army.

source: གང་ཡང་བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་འདི། །འཆང་བ་དང་ནི་ཀློག་གམ་སྟོན་པ་ཡི། །དེ་ཡི་རྣམ་པར་སྨིན་པ་སངས་རྒྱས་མཁྱེན། །
en: {53} The Buddha knows the result that ripens For the one who possesses, recites, Or teaches this prayer for good conduct.

source: བྱང་ཆུབ་མཆོག་ལ་སོམ་ཉི་མ་བྱེད་ཅིག །
en: Do not doubt the supreme enlightenment!

source: འཇམ་དཔལ་ཇི་ལྟར་མཁྱེན་ཅིང་དཔའ་བ་དང་། །ཀུན་ཏུ་བཟང་པོ་དེ་ཡང་དེ་བཞིན་ཏེ། །
en: {57} Just as the hero Mañjuśrī knows, In that way so does Samanta­bhadra.

source: དེ་དག་གི་ནི་རྗེས་སུ་བདག་སློབ་ཅིང་། །དགེ་བ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བསྔོ། །
en: In practicing in the same way as they do, I am dedicating all this merit.

source: དུས་གསུམ་གཤེགས་པ་རྒྱལ་བ་ཐམས་ཅད་ཀྱིས། །བསྔོ་བ་གང་ལ་མཆོག་ཏུ་བསྔགས་པ་དེས། །བདག་གི་དགེ་བའི་རྩ་བ་འདི་ཀུན་ཀྱང་། །བཟང་པོ་སྤྱོད་ཕྱིར་རབ་ཏུ་བསྔོ་བར་བགྱི། །
en: {55} With the prayer that is praised as supreme By all the jinas in the three times, I am dedicating all this merit For the supreme good conduct.

source: བདག་ནི་འཆི་བའི་དུས་བྱེད་གྱུར་པ་ན། །སྒྲིབ་པ་ཐམས་ཅད་དག་ནི་ཕྱིར་བསྩལ་ཏེ། །མངོན་སུམ་སྣང་བ་མཐའ་ཡས་དེ་མཐོང་ནས། །བདེ་བ་ཅན་གྱི་ཞིང་དེར་རབ་ཏུ་འགྲོ། །
en: {56} When the time has come for me to die, May I dispel all obscurations, See Amitābha before me, And go to the Sukhāvatī realm.

source: དེར་སོང་ནས་ནི་སྨོན་ལམ་འདི་དག་ཀྱང་། །ཐམས་ཅད་མ་ལུས་མངོན་དུ་གྱུར་པར་ཤོག །དེ་དག་མ་ལུས་བདག་གིས་ཡོངས་སུ་བསྐང་། །
en: {57} When I have gone there, may these prayers All become completely manifest.

source: འཇིག་རྟེན་ཇི་སྲིད་སེམས་ཅན་ཕན་པར་བགྱི། །
en: May I fulfill them all without exception And benefit beings for as long as there are worlds.

source: རྒྱལ་པའི་དཀྱིལ་འཁོར་བཟང་ཞིང་དགའ་བ་དེར། །པད་མོ་དམ་པ་ཤིན་ཏུ་མཛེས་ལས་སྐྱེས། །སྣང་བ་མཐའ་ཡས་རྒྱལ་བས་མངོན་སུམ་དུ། །ལུང་བསྟན་པ་ཡང་བདག་གིས་དེར་ཐོབ་ཤོག །
en: {58} May I be born from a beautiful, perfect lotus In that pleasant, beautiful circle of the jinas, And there obtain my prophecy Directly from the Jina Amitābha.

source: དེར་ནི་བདག་གིས་ལུང་བསྟན་རབ་ཐོབ་ནས། །སྤྲུལ་པ་མང་པོ་བྱེ་བ་ཕྲག་བརྒྱ་ཡིས། །བློའི་སྟོབས་ཀྱིས་ཕྱོགས་བཅུ་རྣམས་སུ་ཡང་། །སེམས་ཅན་རྣམས་ལ་ཕན་པ་མང་པོ་བགྱི། །གང་གིས་བཟང་པོ་སྤྱོད་པ་སྟོན་པ་ཡིས། །
en: {59} Having obtained there the prophecy, May I through the power of mind Bring many benefits to beings in the ten directions Through many billions of emanations.

source: དགེ་བ་ཅུང་ཟད་བདག་གིས་ཅི་བསྩགས་པ། །དེས་ནི་འགྲོ་བའི་སྨོན་ལམ་དགེ་བ་རྣམས། །སྐད་ཅིག་གཅིག་གིས་ཐམས་ཅད་འབྱོར་བར་ཤོག །གང་ཡང་བཟང་པོ་སྤྱོད་པ་བསྔོས་པ་ཡིས། །
en: {60} May what little merit I have accumulated Through reciting the good conduct prayer Cause the virtuous prayers of beings All to be fulfilled in an instant.

source: བསོད་ནམས་མཐའ་ཡས་དམ་པ་ཐོབ་པ་དེས། །འགྲོ་བ་སྡུག་བསྔལ་ཆུ་བོར་བྱིང་བ་རྣམས། །
en: {61} Through the sublime, endless merit attained By my dedicating the good conduct, May the beings drowning in a river of suffering Depart to the supreme residence of Amitābha.

source: འོད་དཔག་མེད་པའི་གནས་རབ་འགྲོ་བར་ཤོག །ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །སངས་རྒྱས་ཕལ་པོ་ཆེ་ཞེས་བྱ་བ་ལས། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ནང་། སྡོང་པོས་བརྒྱན་པ་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་ཆེན་པོ་ལས།
en: {62} The compilation of Sudhana’s conduct of honoring kalyāṇamitras from the great Dharma teaching entitled “Stem Array” from within the “Bodhisattva­piṭaka,” “The Mahāvaipulya Sūtra Entitled ‘A Multitude of Buddhas,’ ” is concluded.

source: ནོར་བཟངས་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བའི་སྤྱོད་པ་ཕྱོགས་གཅིག་སྟེ་ཅི་སྙེད་པ་རྫོགས་སྷོ།། །།
en: This concludes the episodes of Sudhana’s conduct of honoring kalyāṇamitras from the great Dharma teaching, “The Stem Array.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། སུ་རེནྡྲ་བོ་དྷི་དང་། ཞུས་ཆེན་གྱི་ལོ་ཙཱ་བ་བནྡེ་ཡེ་ཤེས་སྡེ། ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པའོ།། །།
en: This was translated and revised by the Indian upādhyāyas Jinamitra and Surendrabodhi and by the chief editor Lotsawa Bandé Yeshé Dé and others.

source: དེ་ལྟར་བདེ་བར་གཤེགས་པའི་བཀའ་འཁོར་ལོ་རིམ་པ་གསུམ་ལས། འདིར་ཐ་མ་དོན་དམ་རྣམ་པར་ངེས་པའི་འཁོར་ལོའི་སྙིང་པོ་ཕུལ་དུ་བྱུང་བ་སངས་རྒྱས་ཕལ་པོ་ཆེ་མཚན་གྱི་རྣམ་གྲངས་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་སྡེ་སྣོད། སྙན་གྱི་གོང་རྒྱན།
en: Tibetan Editor’s Colophon Tashi Wangchuk A Multitude of Buddhas is the marvelous essence of the final, ultimate, definitive wheel from among the three wheels of the Sugata’s teaching.

source: པདྨའི་རྒྱན་སོགས་དུ་མ་དང་ལྡན་པ་ལ། དེ་བཞིན་གཤེགས་པ་ཕལ་པོ་ཆེའི་ལེའུ།
en: It has many other titles, such as The Mahāvaipulya Basket, The Earring, The Lotus Adornment, and so on.

source: རྡོ་རྗེ་རྒྱལ་མཚན་གྱི་བསྔོ་བ། ས་བཅུ་བསྟན་པ། ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་བསྟན་པ། དེ་བཞིན་གཤེགས་པའི་སྐྱེ་བ་དང་འབྱུང་བ་བསྟན་པ། འཇིག་རྟེན་ལས་འདས་པའི་ལེའུ།
en: It has seven sections:A Multitude of Tathāgatas,The Vajra Banner Dedication,The Teaching of the Ten Bhūmis,The Teaching of Completely Good Conduct,The Teaching of the Birth and Appearance of the Tathāgatas,The Transcendence of the World, and Stem Array.

source: སྡོང་པོས་བརྒྱན་པའི་ལེའུ་སྟེ་བདུན་ལ་སོ་སོའི་ནང་གསེས་ཀྱི་དབྱེ་བས་ལེའུ་བཞི་བཅུ་རྩ་ལྔ།
en: These are subdivided into forty-five chapters.

source: ཤློ་ཀ་སུམ་ཁྲི། དགུ་སྟོང་སུམ་ཅུ། བམ་པོ་བརྒྱ་སུམ་ཅུ་དང་ཤློ་ཀ་སུམ་ཅུ་ཡོད་པར་བུ་སྟོན་རིན་པོ་ཆེ་སོགས་བཞེད་ཅིང་།
en: According to Butön Rinpoché and others, it contains thirty-nine thousand and thirty verses, a hundred and thirty fascicles, and an additional thirty verses.

source: ཚལ་པ་བཀའ་འགྱུར་གྱི་དཀར་ཆག་ཏུ་བམ་པོ་བརྒྱ་དང་བཅོ་ལྔ། ལྡན་དཀར་མར་བམ་པོ་བརྒྱ་དང་ཉི་ཤུ་རྩ་བདུན་དུ་མཛད། དེང་སང་གི་དཔེ་རྣམས་ལའང་བམ་གྲངས་མང་ཉུང་ཅི་རིགས་ཡོད་པར་སྣང་།
en: In the Tshalpa Kangyur edition there are a hundred and fifteen fascicles, the Denkarma edition has a hundred and twenty-seven fascicles, and present-day editions have various numbers of fascicles.

source: འདི་ཐོག་མར་འཕགས་པ་ཀླུ་སྒྲུབ་ལ། པཎྜི་ཏ་བྱང་ཆུབ་བཟང་པོ་དང་པཎྜི་ཏ་དགའ་བ་གཉིས་ཀྱིས་ཞུས། དེ་གཉིས་ཀས་རྒྱ་ནག་ཏུ་འགྱུར་མཛད།
en: This sūtra was first received from Ārya Nāgārjuna by Paṇḍita Buddhabhadra and Paṇḍita Śikṣānanda (652–710), and they both translated it into Chinese.

source: རྒྱ་ནག་གི་འགྱུར་ལ། སུ་རེནྟྲ་བོ་དྷི་དང་། བཻ་རོ་ཙ་ན་རཀྵི་ཏས་ཞུས་ཆེན་མཛད་པར་བཤད་ཅིང་།
en: It is taught that Surendrabodhi and Vairocana­rakṣita became principal editors for a Chinese translation.

source: ལུང་གི་བརྒྱུད་རིམ་ལའང་རྒྱ་ནག་ནས་འགྱུར་བའི་བརྒྱུད་པ་ནི། རྫོགས་པའི་སངས་རྒྱས། འཕགས་པ་འཇམ་དཔལ། མགོན་པོ་ཀླུ་སྒྲུབ། གོང་གི་པཎྜི་ཏ་གཉིས།
en: As for the lineage of the text, there is the lineage from China: The perfect Buddha, Ārya Mañjuśrī, Lord Nāgārjuna, the two paṇḍitas mentioned above, and Heshang Tushun.

source: དེ་ནས་ཧྭ་ཤང་ཐུ་ཐུ་ཞུན་སོགས་རིམ་པར་བརྒྱུད་དེ། ཧྭ་ཤང་གྱིང་ཇུ་ལ་དབུས་པ་སངས་རྒྱས་འབུམ་གྱིས་གསན།
en: Then the lineage continued through others until Üpa Sangyé Bum received it from Heshang Gying-ju.

source: དེ་ནས་ལོ་ཙཱ་བ་མཆོག་ལྡན་ནས་དེང་སང་གི་བར་དུ་བརྒྱུད་པ་དང་།
en: Then that lineage was passed on through Lotsawa Chokden and has continued up to the present time.

source: རྒྱ་གར་ནས་འགྱུར་བའི་བརྒྱུད་པ་ནི། ཀླུ་སྒྲུབ་ནས། ཨཱརྻ་དེ་ཝ། འཇམ་དཔལ་གྲགས་པ་སོགས་ནས་རིམ་བཞིན། རྡོ་རྗེ་གདན་བ་རི་ལོ་ཙཱ་བས་གསན།
en: The lineage from India is as follows: It was passed from Nāgārjuna to Āryadeva, and then Mañjuśrīkīrti, and so on, until Bari Lotsawa received it from Vajrāsana.

source: དེ་ནས་མཆིམས་བརྩོན་སེང་། རྗེ་བཙུན་ས་སྐྱ་པ་ཆེན་པོ་སོགས་བརྒྱུད་པར་བཤད་དོ། །
en: It is taught that the lineage then continued through Chim Tsöndrü Sengé, the great Sakya Lord, and so on.

source: འོན་ཀྱང་གོང་གི་འགྱུར་བྱང་འདི་ལས་ལོ་པཎ་གཞན་གྱིས་བསྒྱུར་ཚུལ་ལོ་རྒྱུས་དང་། དཔེ་རྣམས་ལ་མ་མཐོང་ངོ་། །
en: However, I have not seen any other text or history of a translation made by any other lotsawa or paṇḍita other than those listed in the colophon to this translation into Tibetan.

source: འདི་ཉིད་ཚལ་བ་བཀའ་འགྱུར་གྱི་མ་ཕྱི་བྱས་ནས་འཇང་ས་ཐམ་རྒྱལ་པོས་བཀའ་འགྱུར་རོ་ཅོག་པར་དུ་བསྒྲུབས་པ་དེང་སང་ལི་ཐང་མཆལ་བར་དུ་གྲགས་པ་ཁུངས་ཐུབ་ཀྱི་ཚད་མར་བཟུང་ནས་མ་ཕྱི་བྱས་པ་ཡིན་ཀྱང་།
en: The king of Jangsa Tham had a complete Kangyur made that was based on the Tshalpa Kangyur. At the present time this is known as the Lithang Tshalpa Kangyur (1609–14). I considered this to be a reliable source and so have made it the basis for this edition.

source: སྐབས་འདིར་ཆད་ལྷག་དང་བརྡ་མ་དག་པ་མང་བ་འདུག་པས། སླར་ཡིག་རྙིང་དག་པ་མང་དུ་བཙལ་ནས་ཞུ་དག་བགྱིས་པ་ཡིན་ལ།
en: However, it has many omissions, accretions, and misspellings, and therefore I have at this time corrected it by seeking out many older editions.

source: དེའང་རྒྱ་དཔེ་མི་གཅིག་པ་དང་། འགྱུར་མི་མཐུན་པ་ནི་དོན་གྱི་ཁོག་གཅིག་ཀྱང་ཚིག་ལ་ཞུ་དག་མི་བཏུབ་ནའང་།
en: There are variant Indian texts and conflicting translations, and I have not been able to ascertain from them a definitive single meaning or correct words.

source: འདིའི་དཔེ་ཕལ་ཆེར་ཞུ་དག་ཕེར་བ་ཁོ་ན་འདུག་ལ་འོན་ཀྱང་རྒྱན་ལ་བཀོད་པ་དང་། འབྱམ་ཀླས་ལ་རབ་འབྱམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ལ།
en: Nevertheless, this text is nothing but a valid edition.

source: ཐ་དད་པ་ཡང་དག་པར་ཤེས་པ་དང་། ཐུགས་ལ་དགོངས་པ་དང་།
en: There are varying translations of terms that have been left unrevised, as there is no contradiction in meaning.

source: ཉིན་མཚན་དང་ཟླ་བ་ཡར་ཁམ་མར་ཁམ་དང་ཞེས་པ་ལ།
en: For example, it has rgyan instead of bkod pa;’byam klas instead of rab ’byams;so so yang dag par rig pa instead of tha dad pa yang dag par shes pa;thugs for dgongs pa;nyin mtshan dang zla ba yar kham mar kham dang instead of nyin mtshan dang yud du yan man dang; and tha snyad instead of rnam par dpyod pa.

source: ཉིན་མཚན་དང་ཡུད་དུ་ཡན་མན་དང་ཞེས་དང་། ཐ་སྙད་ལ་རྣམ་པར་དཔྱོད་པ་ཞེས་པ་རྣམས་འགྱུར་ཁྱད་ལྟ་བུར་འདུག་པ་དོན་ལ་མི་འགལ་བས་རང་སོར་བཞག །རྒྱ་སྐད་ལ་རང་བཞིན་རྐྱེན། རྣམ་འགྱུར་གྱི་ཚུལ་དུ་མ་ཡོད་པ། བོད་ལ་ལོ་པཎ་ཆོས་ཀྱི་སྤྱན་ལྡན་རྣམས་ཀྱིས་དོན་འགྱུར་མཛད་པ་འགའ་ཞིག །
en: Sanskrit words have many cases and tenses, so that although the Tibetan lotsawas and paṇḍitas, who had the eyes of the Dharma, translated their meaning, their tenses, cases, and so on are difficult to discern.

source: དུས་དང་རྣམ་དབྱེ་སོགས་ཤིན་ཏུ་རྟོགས་དཀའ་བས་དཔེ་མཐུན་ཤས་ཆེ་བ་གཙོ་བོར་བཟུང་། གཞན་དོགས་གནས་ཅུང་ཟད་ཡོད་པ་རྣམས། བོད་ཀྱི་བརྡའི་བསྟན་བཅོས་རྣམས་དང་གོ་བསྟུན།
en: Those are the majority of the examples of uncertainty, and there are also a few other kinds, but they are nevertheless in accord with Tibetan grammar.

source: དཔེ་ཕལ་ཆེར་ལ་བརྡ་རྙིང་ཤས་ཆེ་བ་དང་།
en: In most texts there are many archaic words, so that the meaning of the translation is not clear, but there is a consistency when those words are all in archaic Tibetan.

source: འགྱུར་བཅོས་མཛད་པའི་གསལ་ཁ་མི་སྣང་བས། བོད་ཀྱི་བརྡ་རྙིང་པ་ཤ་སྟག་ཞིག་བྱུང་ན་འབྲེལ་ཆགས་པ་འདྲ་ཡང་ཕྱིས་སུ་བརྡ་གསར་རྙིང་འདྲེས་ཉམས་ཆེ་བ་དང་།
en: However, there appears to have occurred in later times a strong adulteration of the text so that there is a mixture of archaic and modern forms.
